// Задача 28. Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24
// 5 -> 120

//------------------------  START  -----------------------------------------------------------------

int DataEntry(string str) // метод ввода числа
{
    Console.Write(str);
    int number = int.Parse(Console.ReadLine());
    return number;
}

int FindMultiplication(int num)  // метод расчёта произведения чисел от 1 до N
{
    int multi = 1;
    for (int i = 1; i <= num; i++)
    {
        multi = multi * i;
    }
    return multi;
}

//---------------------  РАБОЧАЯ ОБЛАСТЬ  ----------------------------------------------------------

int number = DataEntry("Введите число А: "); // получить число от пользователя
int result = FindMultiplication(number);
Console.WriteLine($"Произведение всех чисел от 1 до {number} равняется {result}");

// ----------------------  END  --------------------------------------------------------------------